{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 324, 324, 3]], "num_parameters": 0}, {"name": "input_3", "id": "input_3", "class_name": "InputLayer", "output_shape": [[null, 324, 324, 3]], "num_parameters": 0}, {"name": "input_4", "id": "input_4", "class_name": "InputLayer", "output_shape": [[null, 324, 324, 3]], "num_parameters": 0}, {"name": "model", "id": "model", "class_name": "Functional", "output_shape": [null, 100], "num_parameters": 1352164}, {"name": "concatenate", "id": "concatenate", "class_name": "Concatenate", "output_shape": [null, 300], "num_parameters": 0}], "edges": [["input_2", "model"], ["input_3", "model"], ["input_4", "model"], ["model", "concatenate"], ["model", "concatenate"], ["model", "concatenate"]]}